Kesavan-Shanmugam/LPC2148/CODE/SPI/transmit/transmit.c

#include<lpc214x.h>

#define rs 1<<24
#define en 1<<25
#define CS 1<<7

void delay()
{
    int i,j;
    for(i=0; i<300; i++)
    {
        for(j=0; j<300; j++);
    }
}

void pll()
{
    PLL0CON=0X01;
    PLL0CFG=0X24;
    PLL0FEED=0XAA;
    PLL0FEED=0X55;
    while(!PLL0STAT & (1<<10));
    PLL0CON=0X03;
    PLL0FEED=0XAA;
    PLL0FEED=0X55;
    VPBDIV=0X02;
}

void display_command(char c)
{
    IOCLR1=0X0FFF<<16;
    IOSET1=(c<<16);
    IOCLR1=rs;
    IOSET1=en;
    delay();
    IOCLR1=en;
}

void display_data(char d)
{
    IOCLR1=0X0FFF<<16;
    IOSET1=(d<<16);
    IOSET1=rs;
    IOSET1=en;
    delay();
    IOCLR1=en;
}

void SPI_INIT()
{
    IODIR0=CS;                    //GPIO OUTPUT FOR CS
    PINSEL0=0X00001500;           //SPI PIN SELECT 
    S0SPCR=0X0020;                //ENABLE MOSTER MODE
    S0SPCCR=0X3C;                 //SPL CLOCK(60/60=1, 60 HEX VALUE 0X3C)

}

int SPI_write(char w)
{
    IOSET0=CS;                    //CS HIGH
    delay();
    IOCLR0=CS;                    //CS LOW

    S0SPDR=0X06;                  //WRITE ENABLE FOR EEPROM(25AA640)
    while((S0SPSR & 0X80)==0);    //SPI IF

    IOSET0=CS;                    //CS HIGH
    delay();
    IOCLR0=CS;                    //CS LOW

    S0SPDR=0X02;                  //WRITE COMMAND
    while((S0SPSR & 0X80)==0);    //SPI IF

    S0SPDR=0X00;                  //LOW BYTE ADDRESS
    while((S0SPSR & 0X80)==0);    //SPI IF

    S0SPDR=0X00;                  //HIGH BYTE ADDRESS
    while((S0SPSR & 0X80)==0);    //SPI IF

    S0SPDR=w;                     //SET DATA
    while((S0SPSR & 0X80)==0);    //SPI IF


    IOSET0=CS;
	return w;	  
}

int main()
{
    char data;
    IODIR1=0X0FFF<<16;

    SPI_INIT();

	pll();

    data=SPI_write('k');
	display_command(0X0E);
	display_command(0X80);
	display_data(data);

	while(1);
 }

